In [2]:
%load_ext sql
%sql sqlite:///tst_1.db

'Connected: @tst_1.db'

In [3]:
%%sql 
drop table if exists Faculties;

CREATE TABLE Faculties 
(
    id integer primary key, 
    FName varchar(50)
);

 * sqlite:///tst_1.db
Done.
Done.

[]

In [4]:
%sql select * from Faculties

 * sqlite:///tst_1.db
Done.

[]

In [5]:
%%sql
insert Into Faculties(id, fname) values (1, 'KIB');
insert Into Faculties(id, fname) values (2, 'IT');
insert Into Faculties(id, fname) values (3, 'Economics');

 * sqlite:///tst_1.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [6]:
%%sql
PRAGMA foreign_keys = ON;

 * sqlite:///tst_1.db
Done.

[]

In [7]:
%%sql 
drop table if exists Students;

CREATE TABLE Students 
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50), 
    Faculty_id integer ,
    StudyGroup varchar(20),
    GPA number,
    foreign key(faculty_id) references  Faculties(id)
);

 * sqlite:///tst_1.db
Done.
Done.

[]

In [8]:
%%sql
insert into Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (1, 'Anton', 'Sidorov', 1, '101', 3.5);
insert into Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (2, 'Alexey', 'Petrov', 2, '201', 3.3);
insert into Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (3, 'Ivan', 'Meshkov', 1, '101', 4.5);
insert into Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (4, 'Elena', 'Kvitova', 2, '301', 4.8);
insert into Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (5, 'Darya', 'Salnikova', 2, '202', 3.4);

 * sqlite:///tst_1.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%sql select* from Students

 * sqlite:///tst_1.db
Done.

[(1, 'Anton', 'Sidorov', 1, '101', 3.5),
 (2, 'Alexey', 'Petrov', 2, '201', 3.3),
 (3, 'Ivan', 'Meshkov', 1, '101', 4.5),
 (4, 'Elena', 'Kvitova', 2, '301', 4.8),
 (5, 'Darya', 'Salnikova', 2, '202', 3.4)]

## Задание 1. Напишите SQL-запрос, возвращающий ваше имя

In [10]:
%sql select 'sanya'

 * sqlite:///tst_1.db
Done.

[('sanya',)]

# Задание 2. Напишите SQL-запрос, возвращающий имена всех студентов с фамилией Sidorov

In [11]:
%%sql 
SELECT *
  FROM Students
 WHERE SecondName = 'Sidorov'

 * sqlite:///tst_1.db
Done.

[(1, 'Anton', 'Sidorov', 1, '101', 3.5)]

# Задание 3. Выведите все названия факультетов, на которых учится хотя бы один студент со средним баллом не менее 4. Имя факультета должно встречаться один раз в выводе

In [14]:
%%sql 
select distinct Fname
from Faculties f
join students s
on f.id = s.Faculty_id
where s.GPA >= 4;

 * sqlite:///tst_1.db
Done.

[('KIB',), ('IT',)]

# Задание 4. Вывести только тех студентов, фамилия которых начинается с 'S', а в имени присутствует 'a'.

In [13]:
%%sql 
select* 
from students
where SecondName like 'S%'
and name like '%a%'
and name not like 'A%'

 * sqlite:///tst_1.db
Done.

[(5, 'Darya', 'Salnikova', 2, '202', 3.4)]

# Задание 5. Вывести только те факультеты, количество групп в которых больше 3

In [130]:
%%sql 
select F.Fname
from Faculties f
join students s
on f.id = s.Faculty_id
group by F.Fname,s.Faculty_id
having count(StudyGroup)>=3

 * sqlite:///tst_1.db
Done.

[('IT',)]

# Задание 6. Для всех факультетов вывести средний балл по факультету для студентов, чья фамилия не содержит в себе подстроку 'ov', при условии, что количество таких студентов на факультете не менее 3. В обратном случае, факультет выводить не требуется

In [95]:
%%sql 
select avg(GPA),f.id
from students s
join Faculties f
on f.id = s.Faculty_id
where SecondName like '%ov%'
group by F.id
having count(SecondName)>=3

 * sqlite:///tst_1.db
Done.

[(3.8333333333333335, 2)]

In [23]:
%%sql 
select  f.id ,avg(gpa) as gpa
    from students s
      join Faculties f
        on f.id = s.Faculty_id,   
        (select count(a.student_id) as kolvo,b.id as id
                from students a
                    join Faculties b
                    on b.id = a.Faculty_id
                    group by b.id
                    having count(a.student_id)<=20
            ) huy
where s.SecondName like '%ov%'
group by f.id
having count(s.student_id)>=3

 * sqlite:///tst_1.db
Done.

[(1, 4.0), (2, 3.8333333333333335)]

In [137]:
%%sql 
select f.id,

case
WHEN NAME is null
then "net"
else Name
end NAME

from Faculties f
left join students s
on f.id = s.Faculty_id

 * sqlite:///tst_1.db
Done.

[(1, 'Anton'),
 (1, 'Ivan'),
 (2, 'Alexey'),
 (2, 'Darya'),
 (2, 'Elena'),
 (3, 'net')]

In [139]:
%%sql 
update students
set StudyGroup = 10000
where faculty_id is 2

 * sqlite:///tst_1.db
3 rows affected.

[]

In [138]:
%%sql
select*
from Faculties f
left join students s
on f.id = s.Faculty_id

 * sqlite:///tst_1.db
Done.

[(1, 'KIB', 1, 'Anton', 'Sidorov', 1, '101', 3.5),
 (1, 'KIB', 3, 'Ivan', 'Meshkov', 1, '101', 4.5),
 (2, 'IT', 2, 'Alexey', 'Petrov', 2, '10000', 3.3),
 (2, 'IT', 5, 'Darya', 'Salnikova', 2, '10000', 3.4),
 (2, 'IT', 4, 'Elena', 'Kvitova', 2, '10000', 4.8),
 (3, 'Economics', None, None, None, None, None, None)]